benchmark/fiber-fd4db91+pprof/benchmark.txt
BeliMangTestCasesPB2W4 on  main [!] is 📦 v1.0.0 via 🐹 v1.22.3 via  on ☁️  (ap-southeast-1) took 2m13s
❯ make load-test
git pull origin main;
From https://github.com/nandanugg/BeliMangTestCasesPB2W4
 * branch            main       -> FETCH_HEAD
Already up to date.
LOAD_TEST=true k6 run index.js;

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: index.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m18s max duration (incl. graceful stop):
              * default: Up to 300 looping VUs for 48s over 8 stages (gracefulRampDown: 30s, gracefulStop: 30s)

INFO[0003] ⛑️ ARMING... ⛑️                               source=console
INFO[0003] 🚀 NUKE READY!                                 source=console
INFO[0003] 💥 FAYYYAAAAH! 🇯🇵                              source=console
INFO[0003] Adding all pregenerated merchants... 😰        source=console
INFO[0010] All pregenerated merchants added! 🥳           source=console
INFO[0060] Test ended, I recomend to remove all of your merchants before re-run the test to avoid miss estimation on nearest merchant location.  source=console

     ✓ Admin Register | valid payload | should return 201
     ✓ Admin Register | register twice | should return 409
     ✓ Admin Login | valid payload | should return 200
     ✓ Merchant Get | no param | should return 200
     ✓ Merchant Get | no param | should have the correct total data based on pagination
     ✓ Merchant Get | no param | should have merchantId
     ✓ Merchant Get | no param | should have name
     ✓ Merchant Get | no param | should have imageUrl
     ✓ Merchant Get | no param | should have merchantCategory
     ✓ Merchant Get | no param | should have createdAt with correct format
     ✓ Merchant Get | no param | should have return ordered correctly
     ✓ Merchant Get | no param | should have location.lat
     ✓ Merchant Get | no param | should have location.long
     ✓ Merchant Get | no param | should have meta.limit
     ✓ Merchant Get | no param | should have meta.offset
     ✓ Merchant Get | no param | should have meta.total
     ✓ Merchant Get | with name=a param | should have name with "a" in it
     ✓ Merchant Get | with merchantCategory=BoothKiosk param | should have "BoothKiosk" category in it
     ✓ Merchant Get | with createdAt=asc param | should have return ordered correctly
     ✓ Merchant Get | pagination | should have the correct total data based on pagination
     ✓ User Register | valid payload | should return 201
     ✓ User Register | register twice | should return 409
     ✓ User Login | valid payload | should return 200
     ✓ User Get Nearby Merchant | no param | should have the correct nearest merchant
     ✓ User Get Nearby Merchant | with name=a param | should have name with "a" in it
     ✓ User Get Nearby Merchant | with merchantCategory=BoothKiosk param | should have "BoothKiosk" category in it
     ✓ User Estimate Order Test | get merchant items | should return 200
     ✓ User Estimate Order Test | get merchant items | should have itemId
     ✓ User Estimate Order Test | add merchant items if not exists | should return 201
     ✓ User Estimate Order Test | add merchant items if not exists | should have itemId
     ✓ User Estimate Order Test | valid payload | should return 200
     ✓ User Estimate Order Test | valid payload | should have totalPrice and equal to calculated total
     ✓ User Estimate Order Test | valid payload | should have calculatedEstimateId
     ✓ User Estimate Order Test | valid payload | should have estimatedDeliveryTimeInMinutes and not far from precalculated result
     ✓ User Order Test | valid payload | should return 201
     ✓ User Order Test | valid payload | should have orderId
     ✓ User Get Order Test | no param | should return 200
     ✓ User Get Order Test | no param | should have the correct total data based on pagination
     ✓ User Get Order Test | no param | should have merchant.merchantId
     ✓ User Get Order Test | no param | should have merchant.name
     ✓ User Get Order Test | no param | should have merchant.imageUrl
     ✓ User Get Order Test | no param | should have merchant.merchantCategory
     ✓ User Get Order Test | no param | should have merchant.createdAt
     ✓ User Get Order Test | no param | should have merchant.location.lat
     ✓ User Get Order Test | no param | should have merchant.location.long
     ✓ User Get Order Test | no param | should have items.itemId
     ✓ User Get Order Test | no param | should have items.name
     ✓ User Get Order Test | no param | should have items.imageUrl
     ✓ User Get Order Test | no param | should have items.productCategory
     ✓ User Get Order Test | no param | should have items.createdAt
     ✓ User Get Order Test | with name=a param | should have name with "a" in it
     ✗ User Get Order Test | with merchantCategory=BoothKiosk param | should have "BoothKiosk" category in it
      ↳  89% — ✓ 1513 / ✗ 184
     ✓ User Get Order Test | pagination | should have the correct total data based on pagination

     █ setup

       ✓ Admin Register | valid payload | should return 201
       ✓ Admin Register | register twice | should return 409
       ✓ Admin Login | valid payload | should return 200
       ✓ Merchant Post | valid payload | should return 201
       ✓ Merchant Post | valid payload | should have merchantId

     █ teardown

     checks.........................: 99.88% ✓ 154416      ✗ 184
     data_received..................: 910 MB 16 MB/s
     data_sent......................: 29 MB  507 kB/s
     grpc_req_duration..............: avg=56.01ms  min=91.91µs  med=2.06ms  max=2.99s    p(90)=82.99ms  p(95)=254.69ms
     http_req_blocked...............: avg=67.78µs  min=538ns    med=2.58µs  max=305.4ms  p(90)=5.84µs   p(95)=8.11µs
     http_req_connecting............: avg=50.09µs  min=0s       med=0s      max=106.82ms p(90)=0s       p(95)=0s
     http_req_duration..............: avg=38.07ms  min=323.03µs med=7.37ms  max=1.54s    p(90)=113.93ms p(95)=171.04ms
       { expected_response:true }...: avg=38.56ms  min=323.03µs med=7.78ms  max=1.54s    p(90)=115ms    p(95)=173.61ms
     http_req_failed................: 4.87%  ✓ 3395        ✗ 66270
     http_req_receiving.............: avg=803.64µs min=7.61µs   med=42.01µs max=1.5s     p(90)=96.01µs  p(95)=135.42µs
     http_req_sending...............: avg=89.96µs  min=3.03µs   med=15.15µs max=335.12ms p(90)=40.24µs  p(95)=52.87µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=37.18ms  min=288.25µs med=7.27ms  max=806.86ms p(90)=112.6ms  p(95)=168.61ms
     http_reqs......................: 69665  1219.320949/s
     iteration_duration.............: avg=3.21s    min=4.67ms   med=1.73s   max=11.28s   p(90)=8.58s    p(95)=9.15s
     iterations.....................: 1697   29.701969/s
     vus............................: 31     min=0         max=300
     vus_max........................: 300    min=300       max=300


running (0m57.1s), 000/300 VUs, 1697 complete and 0 interrupted iterations
default ✓ [======================================] 000/300 VUs  48s

BeliMangTestCasesPB2W4 on  main [!] is 📦 v1.0.0 via 🐹 v1.22.3 via  on ☁️  (ap-southeast-1) took 1m3s
❯